#include <string>
#include <stack>

/***********************************************************************
  Даден е символен низ, състоящ се от кръглите скоби '(',
  ')', запетайки ',' и малки латински букви. Да се реализира функция
  bool valid(const std::string &s, unsigned& error), която проверява
  дали низът, записан в s, е правилно записан функционален израз
  съгласно следните правила:

	<променлива> ::= a | b | … | z
	<израз> ::= <променлива> | <променлива>(<израз>{,<израз>})

  Ако низът s не е коректен, в параметъра error да се запише индексът
  на първия некоректен символ. В реализацията на valid не е позволено
  използването на рекурсия.

  Упътване:
	* В стек записваме отварящи скоби, букви и специален символ
	(например '?'), означаващ “резултат от извикването на
	функция”.
	* Какво трябва да има на върха на стека при прочитане на ','?
	* Какво трябва да се случи със стека при прочитане на ','?
	* Какво трябва да има на върха на стека при прочитане на ')'?
	* Какво трябва да се случи със стека при прочитане на ')'?
	* Освен случаите на ',' и ')', какви още проверки за коректност са
	нужни?
	* Какво съдържание трябва да има стекът след приключване на
	програмата?
************************************************************************/

stack<char> st;

bool valid(const std::string& s, unsigned& error) {
	char curr;

	for (int i = 0; i < s.length(); i++) {

		if (s[i] == '(') {
			st.push('(');
		}

		else if (letter(s[i])) {
			st.push(s[i]);
		}

		else if (s[i] == ',') {
			curr = st.top();
			st.pop();
			if (letter(curr) && letter(s[i + 1])) {
				st.push('?');
				i = i + 2;
			}
			else {
				if (letter(curr))error = i + 1;
				else  error = i - 1;
				return false;
			}
		}

		else if (s[i] == ')') {
			if (st.top() == '?') {
				st.pop();
				st.pop();
			}
			else {
				error = i;
				return false;
			}
		}
		else {
			error = i;
			return false;
		}
	}

	curr = st.top();
	st.pop();
	if (st.top() == nullptr && (letter(curr) || curr == '?')) { return true; }
	else { return false; }
}

bool letter(char symbol) {
	if (symbol <= 'z' and symbol >= 'a') {
		true;
	}
	false;
}

int main()
{
	return 0;
}
